<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Releasenotes</title>
</head>
<body style="font-family: sans-serif; font-size: medium; width: 95vw; max-width: 95vw">
<h2>Version 0.4.0 BETA (30.05.2020)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Adding videos to the queue manually is now possible. A plus button was added you can use
            for that feature.</p>
        <p>Videos inside a path set up for automatic uploads will be filled with their template when added. Videos
            outside those paths will be filled with default values.</p>
    </li>
    <li><p><b>Feature</b>: A button for clearing the queue was added.</p>
    </li>
    <li><p><b>Feature</b>: A confirmation dialog is showed when closing the program while uploads are active.</p>
    </li>
    <li><p><b>Feature</b>: The action "after Uploading" also executes when the queue finishes and automatic uploading
        wasn't active.</p>
    </li>
    <li><p><b>Bugfix</b>: Scaling issues with the queue were fixed</p>
    </li>
    <li><p><b>Bugfix</b>: The program does not crash anymore when changing the max upload speed.</p>
    </li>
    <li><p><b>Bugfix</b>: The next release date for Templates will not be set to January 1st 2000 sometimes anymore.</p>
    </li>
    <li><p><b>Other little bugfixes</b></p></li>
    <li><p style="color: dimgray">Preparing the next release version might take some time. I'll rewrite the application
        in Java to add multi platform support. If you have bugs or suggestions, feel free to submit them. I'll still
        bring them inside the .NET version if possible.</p></li>
</ul>
<p><span style="color: red">If you find Erros</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.14 BETA (13.05.2020)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Bugfixes</p>
    </li>
    <li><p><b>Bugfix</b>: das Problem, durch das Uploads ohne Thumbnails nicht abgeschlossen wurden, sondern 15 mal in
        Folge mit je 1:30 Minuten Wartezeit neu versucht wurden und dann scheiterten, wurde behoben.</p>
    </li>
    <li><p><b>Bugfix</b>: die verbleibende Zeit wird nun auch bei gro&szlig;en Dateien (> 2 GB) korrekt gesch&auml;tzt.
    </p>
    </li>
    <li><p><b>Bugfix</b>: der Fortschritt wird nun beim Icon in der Taskleiste wieder korrekt angezeigt.</p>
    </li>
    <li><p style="color: dimgray">Als n&auml;chstes steht (geplant) Version 0.4.0 an. In dieser Version wird es endlich
        m&ouml;glich sein, den Uploader als ganz normalen Uploader zu verwenden. Man kann dann Videos manuell hinzuf&uuml;gen!
        Die
        Planungen daf&uuml;r laufen bereits. F&uuml;r diese Version werden auch die Tutorial-Videos erneut angepasst
        werden.
    </p></li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.13 BETA (02.05.2020)</h2>
<ul>
    <li><p><b style="color: red">Ein besonderes Dankesch&ouml;n an DarkHunterRPGx, Peacemaker Zockt, Rondral und Drexel
        f&uuml;r
        die Mithilfe bei der Entwicklung dieser Version!</b></p>
    </li>
    <li>
        <p><b>Main feature</b>: Nicht abgeschlossene Uploads werden ab sofort &uuml;ber das Programmende
            hinaus gespeichert und k&ouml;nnen beim erneuten Programmstart fortgesetzt werden.</p>
    </li>
    <li><p><b>Feature</b>: Es gibt nun einen Archiv-Tab im Hauptfenster. In diesem finden sich die Uploads, die in
        vorigen Sitzungen hochgeladen wurden. Videos in dieser Liste k&ouml;nnen manuell verwaltet werden und werden
        nicht
        erneut hochgeladen, auch wenn der Dateiname nicht mit einem Unterstrich beginnt.</p>
    </li>
    <li><p><b>Feature</b>: Der Uploader benennt nun keine Dateien mehr nach dem Upload um, damit sie mit einem
        Unterstrich starten. Stattdessen verschieb er sie ins Archiv. Aktuell werden Dateien mit Unterstrich weiterhin
        nicht hochgeladen, um zu den alten Versionen kompatibel zu bleiben.</p>
    </li>
    <li><p><b>Feature</b>: Der komplette Uploadmechanismus wurde neu geschrieben und ist jetzt deutlich stabiler. Das
        betrifft auch die Berechnung der aktuellen Geschwindigkeit und der noch verbleibenden Restzeit.</p>
    </li>
    <li><p><b>Feature</b>: Es ist nun m&ouml;glich, die Geschwindigkeit der Uploads zu limitieren. Jeder Upload, der l&auml;uft,
        erh&auml;lt die eingestellte Geschwindigkeit als Maximum. Wenn man also 1 MByte/s als Maximum einstellt und drei
        Uploads gleichzeitig laufen l&auml;sst, l&auml;dt der Uploader mit 3 MByte/s hoch, weil jeder Upload auf 1
        MByte/s
        limitiert wird.</p>
    </li>
    <li><p><b>Feature</b>: In der Pfadverwaltung kann nun f&uuml;r Pfade einzeln eingestellt werden, dass Videos nach
        einem
        erfolgreichen Upload in einen anderen Ordner verschoben werden sollen.</p>
    </li>
    <li><p><b>Feature</b>: In der Pfadverwaltung kann nun f&uuml;r Pfade einzeln eingestellt werden, in welcher
        Reihenfolge
        vorhandene Videos beim Start des Autouploaders hinzugef&uuml;gt werden sollen. M&ouml;glich sind Sortierungen
        nach Namen,
        Erstelldatum, &Auml;nderungsdatum und Dateigr&ouml;&szlig;e, alle jeweils auf- und absteigend.</p>
    </li>
    <li><p><b>Feature</b>: Wenn man in der Pfadverwaltung nun alle Videos als hochgeladen markiert, dann werden diese
        ins Archiv gesetzt und nicht wie vorher mit einem Unterstrich als nicht hochzuladen markiert.</p>
    </li>
    <li><p><b>Feature</b>: Wenn ein Template gespeichert werden soll, bei dem Script-Tags nicht richtig geschlossen
        sind, wird ein Warnhinweis angezeigt.</p>
    </li>
    <li><p><b>Feature</b>: Beim Bearbeiten von bereits in die Warteschlange eingef&uuml;gten Uploads wird bei Titel,
        Beschreibung und Tags nun angezeigt, wie viele Zeichen schon genutzt wurden und wie viele insgesamt zur
        Verf&uuml;gung stehen.</p>
    </li>
    <li><p><b>Bugfix</b>: Bei nicht geschlossenen Scripten st&uuml;rzt der Uploader nun nicht mehr ab.</p>
    </li>
    <li><p><b>Bugfix</b>: Ein Fehler, durch den Videos, die bereits in der Warteschlange sind, erneut hinzugef&uuml;gt
        wurden, wurde behoben.</p>
    </li>
    <li><p><b>Bugfix</b>: Der Dateiname der Videodatei wird nun an Youtube &uuml;bertragen. Bisher listet das Youtube
        Studio
        den Dateinamen als "unknown". Diesen Fix habe ich aus dem Quellcode von Drexels VidUp kopiert. Vielen Dank
        daf&uuml;r!</p>
    </li>
    <li><p style="color: dimgray">Als n&auml;chstes steht (geplant) Version 0.4.0 an. In dieser Version wird es endlich
        m&ouml;glich sein, den Uploader als ganz normalen Uploader zu verwenden. Man kann dann Videos manuell hinzuf&uuml;gen!
        Die
        Planungen daf&uuml;r laufen bereits. F&uuml;r diese Version werden auch die Tutorial-Videos erneut angepasst
        werden.</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.12 BETA (04.03.2020)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Bugfixes</p>
    </li>
    <li><p><b>Feature</b>: Anstatt des hoffnungslos veralteten Youtube-Tutorials wurde nun eine Tutorial-Playlist im
        Men&uuml; "Hilfe/Support" verlinkt. Dieses wird von mir mit Videos zur aktuellen Version gepflegt und jeweils an
        die
        neuste Version angepasst.</p>
    </li>
    <li><p><b>Bugfix</b>: Bisher war es nicht m&ouml;glich, bei den Templates in den Beschreibungen eine neue Zeile
        einzuf&uuml;gen, weil stattdessen die &Auml;nderungen gespeichert wurden. Das wurde nun behoben.</p>
    </li>
    <li><p><b>Bugfix</b>: Die m&ouml;glichen Endungen der Videodateien, die der Uploader an Youtube senden kann, wurden
        auf
        die g&auml;ngigsten Containerformate f&uuml;r Videos (z. B. .AVI, .MKV, .MOV, .MP4 und noch ein paar mehr)
        beschr&auml;nkt, um
        zu verhindern, dass man mit dem Tool z. B. Powerpoint-Projekte, Textdateien o. &auml;. hochladen kann, die von
        Youtube eh abgelehnt werden w&uuml;rden.</p>
    </li>
    <li><p><b>Bugfix</b>: Verschiedene Probleme, die durch das gleichzeitige Durchsuchen mehrerer Pfade auftraten und
        zum Programmabsturz f&uuml;hrten, wurden behoben.</p>
    </li>
    <li><p><b>Bugfix</b>: Der Mailversand f&uuml;hrt nun nicht mehr zu einem Programmabsturz, wenn man keine Tags f&uuml;r
        das
        Video angegeben hat.</p>
    </li>
    <li><p style="color: dimgray">Als n&auml;chstes steht (geplant) Version 0.3.13 an. In dieser soll der Uploader die
        Warteschlange beim Programmende nicht mehr vergessen und f&uuml;r hochgeladene Videos ein Archiv f&uuml;hren,
        sodass
        hochgeladene Videos nicht mehr mit einem Unterstrich markiert werden m&uuml;ssen.<br/>
        Danach kommt (geplant) Version 0.4.0. In dieser Version wird es endlich m&ouml;glich sein, den Uploader als ganz
        normalen Uploader zu verwenden. Man kann dann Videos endlich manuell hinzuf&uuml;gen!
    </p></li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.11 BETA (01.02.2020)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Kleine Verbesserungen auf dem Weg zum manuellen Hinzuf&uuml;gen</p>
    </li>
    <li><p><b>Feature</b>: Man kann das Hochladen der Warteschlange und das Hinzuf&uuml;gen der Videos in die
        Warteschlange
        getrennt starten und beenden. Daf&uuml;r wurde &uuml;ber der Warteschlange ein kleiner Abschnitt hinzugef&uuml;gt.
    </p>
    </li>
    <li><p><b>Feature</b>: Beim Template-Bearbeiten wird im Tab f&uuml;r die Ver&ouml;ffentlichungsplanung unten nun
        auch das
        Datum des n&auml;chsten geplanten Uploads angezeigt und kann angepasst werden.</p>
    </li>
    <li><p><b>Feature</b>: Da man nun jederzeit das geplante Datum ver&auml;ndern kann, wird das Fenster, das bisher
        beim
        Start der &Uuml;berwachung angezeigt wurde, optional. Wenn man die &Uuml;berwachung nun per Klick auf den Button
        startet,
        kommt es nicht. Wenn man es anzeigen m&ouml;chte, kann man rechts am Button auf einen kleinen Pfeil klicken und
        es
        dort aus einem Untermen&uuml; ausw&auml;hlen.</p>
    </li>
    <li><p><b>Bugfix</b>: Ab sofort wird die Aktion "am Ende" (Programm schlie&szlig;en, Herunterfahren) nicht mehr
        ausgef&uuml;hrt, wenn das erste Video aus der Warteschlange fertig hochgeladen wurde, sondern erst, wenn die
        gesamte
        Warteschlange beendet wurde.</p>
    </li>
    <li><p><b>Bugfix</b>: Wenn man die Funktion findNumber zum automatisierten Finden von Zahlen genutzt hat, wurden
        Zahlen am Ende des Dateinamens nicht gefunden. Das ist jetzt behoben.</p>
    </li>
    <li><p><b>Bugfix</b>: Wenn ein Pfad beim Start der &Uuml;berwachung nicht mehr existiert (z. B. umbenannt oder gel&ouml;scht
        wurde), dann st&uuml;rzt das Programm nicht mehr ab, benachrichtigt aber auch nicht &uuml;ber dieses Problem.
    </p>
    </li>
    <li><p><b>Bugfix</b>: Wenn man eine Mail f&uuml;r erfolgreiche oder fehlerhafte erhalten wollte und der Uploader
        sich am
        Ende geschlossen hat oder Windows heruntergefahren hat, wurde f&uuml;r das letzte hochgeladene Video keine Mail
        mehr
        versendet. Das wurde korrigiert.</p>
    </li>
    <li><p style="color: dimgray">Als n&auml;chstes steht (geplant) Version 0.3.12 an. In dieser soll der Uploader die
        Warteschlange beim Programmende nicht mehr vergessen und f&uuml;r hochgeladene Videos ein Archiv f&uuml;hren,
        sodass
        hochgeladene Videos nicht mehr mit einem Unterstrich markiert werden m&uuml;ssen.<br/>
        Danach kommt (geplant) Version 0.4.0. In dieser Version wird es endlich m&ouml;glich sein, den Uploader als ganz
        normalen Uploader zu verwenden. Man kann dann Videos endlich manuell hinzuf&uuml;gen!</p></li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.10 BETA (16.12.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Bugfixes</p>
    </li>
    <li><p><b>Feature</b>: Ab sofort zeigt der Uploader auch den Datendurchsatz beim Upload an.</p>
    </li>
    <li><p><b>Bugfix</b>: Das Hinzuf&uuml;gen w&auml;hrend des Uploads erstellter Videos hat nicht richtig funktioniert.
        Jetzt
        geht es wieder.</p>
    </li>
    <li><p><b>Bugfix</b>: Desktop-Benachrichtigungen wurden nicht richtig angezeigt. Das wurde behoben.</p>
    </li>
    <li><p><b>Bugfix</b>: Emojis sollten nun im Template-Fenster angezeigt werden.</p>
    </li>
    <li><p style="color: dimgray">Als n&auml;chstes steht (geplant) Version 0.4.0 an. In dieser Version wird es endlich
        m&ouml;glich sein, den Uploader als ganz normalen Uploader zu verwenden. Man kann dann Videos endlich manuell
        hinzuf&uuml;gen!</p></li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.9 BETA (04.10.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Der Mailversand wurde hinzugef&uuml;gt</p>
    </li>
    <li><p><b>Feature</b>: Ab sofort ist es m&ouml;glich, sich vom Uploader per Mail &uuml;ber den Stand des Uploads
        benachrichtigen zu lassen.</p>
        <ul>
            <li><p>Um die Funktionalit&auml;t zu aktivieren, muss die Verbindung mit dem Account einmal getrennt und mit
                aktivierten Haken "Mailversand aktivieren" wieder hinzugef&uuml;gt werden. Der Uploader erh&auml;lt
                dabei
                ausschlie&szlig;lich die Erlaubnis, Mails zu versenden. Mails abrufen oder lesen kann er dadurch
                nicht.</p>
            </li>
            <li><p>Anschlie&szlig;end kann man in den Templates den Mailversand konfigurieren und einrichten. Der
                Uploader
                sendet dann automatisch Mails an die angegebene Adresse. Die Mails werden von der E-Mail-Adresse des
                Kanals aus gesendet.</p>
            </li>
            <li><p>Ebenfalls lassen sich Desktop-Benachrichtigungen einstellen. F&uuml;r diese wird nat&uuml;rlich
                nichts weiter
                ben&ouml;tigt. ;)</p>
            </li>
        </ul>
    </li>
    <li><p><b>Bugfix</b>: Der Uploader h&auml;ngt nun nicht mehr fest, wenn ein Thumbnail zum Hochladen eingestellt ist,
        aber
        nicht gefunden werden kann.</p>
    </li>
    <li><p>Der Uploader wird als <b>unverifizierte App</b> angezeigt... :(</p>
        <p>Alle Apps, die auf Google-Dienste zugreifen, m&uuml;ssen &uuml;berpr&uuml;ft werden. Dadurch, dass der
            Uploader nach wie vor
            nur eine Beta ist, habe ich ihn noch nicht zur &Uuml;berpr&uuml;fung an Google gesendet und Google zeigt
            beim
            Verkn&uuml;pfen daf&uuml;r einen Warnhinweis an. Die &Uuml;berpr&uuml;fung werde ich durchf&uuml;hren,
            sobald ich mir sicher bin,
            dass ich den Uploader wirklich bis zur Vollversion entwickeln werde.
            Bei der Meldung von Google handelt sich um eine Warnung, keinen Fehler.</p>
    </li>
    <li><p style="color: dimgray"></p></li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.8 BETA (26.05.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Entfernung des separaten Upload-Fensters</p>
    </li>
    <li><p><b>Feature</b>: Der Upload wird nun nicht mehr in einem eigenen Fenster ausgef&uuml;hrt, sondern im
        Hauptfenster.
        Dies ist eine Vorbereitung auf die Version 0.4.0, in der Videos manuell hochgeladen werden k&ouml;nnen.</p>
    </li>
    <li><p><b>Feature</b>: Im Falle eines unerwarteten Problems (z. B. Computer hat die Internetverbindung verloren)
        wartet der Uploader nun 1:30 Minuten und versucht dann, den Upload fortzusetzen. Das macht er insgesamt 10 mal,
        bevor er den Upload dann endg&uuml;ltig abbricht. Vorher wurde der Upload sofort abgebrochen.</p>
    </li>
    <li><p><b>Bugfix</b>: Die Aktion nach dem Beenden aller Uploads hat in Version 0.3.7 nicht wie erwartet
        funktioniert. Der Fehler ist nun behoben.</p>
    </li>
    <li><p style="color: dimgray">Als n&auml;chstes steht (geplant) Version 0.4.0 an. In dieser Version wird es endlich
        m&ouml;glich sein, den Uploader als ganz normalen Uploader zu verwenden. Man kann dann Videos endlich manuell
        hinzuf&uuml;gen!</p></li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.7 BETA (04.05.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Erweiterung der Skriptfunktionen zum Expertenmodus</p>
    </li>
    <li><p><b>Feature</b>: Die C#-Schnittstelle wurde komplett &uuml;berarbeitet und wird nun als "Expertenmodus"
        standardm&auml;&szlig;ig ausgeblendet, da sie f&uuml;r den einfachen Benutzer sehr kompliziert ist.</p>
    </li>
    <li><p><b>Feature</b>: Die Tabs im Expertenmodus enthalten zwei Informationstabs, in denen die Funktionsweise etwas
        erkl&auml;rt wird.</p>
    </li>
    <li><p><b>Feature</b>: Die urspr&uuml;nglichen Funktionen, mit denen der Uploader in 0.1.0 BETA ausgeliefert wurde,
        kamen
        zur&uuml;ck, m&uuml;ssen aber mit C#-Syntax benutzt werden (das ist ein kleines bisschen anders).</p>
    </li>
    <li><p><b>Feature</b>: Es ist nun m&ouml;glich, weitere Assemblies zu referenzieren, um diese benutzen zu k&ouml;nnen.
        Beispielsweise k&ouml;nnte man System.Windows.Forms referenzieren, um nach dem erfolgten Upload eine Messagebox
        anzuzeigen.</p>
    </li>
    <li><p><b>Feature</b>: Das Upload-Nachbereitungsskript wird nun nach Abschluss des Uploads ausgef&uuml;hrt, nicht
        mehr,
        nachdem das Video erfolgreich in die Warteschlange aufgenommen wurde.</p>
    </li>
    <li><p style="color: dimgray">Als n&auml;chstes steht Version 0.4.0 an. In dieser Version wird es endlich m&ouml;glich
        sein,
        den Uploader als ganz normalen Uploader zu verwenden. Man kann dann Videos endlich manuell hinzuf&uuml;gen!</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.6 BETA (31.03.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Kleine &Auml;nderungen</p>
    </li>
    <li><p><b>Feature</b>: Die Aktion nach dem Upload (Zum Hauptmen&uuml;, Programm schlie&szlig;en, Herunterfahren)
        wurde
        &uuml;berarbeitet und sollte nun deutlich stabiler sein. Sollten noch Fehler aufkommen, w&uuml;rde ich mich
        &uuml;ber Infos
        dar&uuml;ber sehr freuen.</p>
    </li>
    <li><p><b>Feature</b>: Der Updater hat eine kleine Aktualisierung erhalten und sollte nun auch etwas stabiler sein.
    </p>
    </li>
    <li><p><b>Bugfix</b>: Der Button zum &Ouml;ffnen des Dialogs zum W&auml;hlen eines Thumbnails beim Editieren eines
        Videos
        funktioniert jetzt. Den hab ich wohl bisher &uuml;bersehen. :D </p>
    </li>
    <li><p style="color: dimgray">Folgendes habe ich bis zur Version 0.4.0 geplant:</p>
        <ul>
            <li><p style="color: dimgray">In Version 0.3.7 wird die C#-Schnittstelle komplett &uuml;berarbeitet
                werden.</p>
            </li>
            <li><p style="color: dimgray">Version 0.4.0 wird dann eine &Uuml;berraschung enthalten.</p></li>
        </ul>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.5 BETA (24.03.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: &Auml;nderungen an der Warteschlange</p>
    </li>
    <li><p><b>Feature</b>: Ab sofort ist es m&ouml;glich, die Videoinformationen auch w&auml;hrend des Uploads zu
        editieren. Die
        Funktion ist beim Aktionsbutton zu finden.</p>
    </li>
    <li><p><b>Feature</b>: Die interne Struktur wurde komplett ge&auml;ndert. Als kleine Nebenwirkung wurde der Uploader
        stabiler.</p>
    </li>
    <li><p><b>Feature</b>: Abgeschlossene Uploads bleiben nun in der Liste und k&ouml;nnen bei Bedarf selbst auf der
        Liste
        entfernt werden - ebenfalls mittels des Aktionsbuttons.</p>
    </li>
    <li><p><b>Bugfix</b>: Die Reihenfolge der hochzuladenen Videos kann ge&auml;ndert werden - &uuml;ber den
        Aktionsbutton kann
        man einen Eintrag nach oben und nach unten verschieben.</p>
    </li>
    <li><p><b>Bugfix</b>: Das Thumbnail wird nun, sofern gefunden, in der Liste angzeigt.</p>
    </li>
    <li><p><b>Bugfix</b>: Fehler werden vom Programm zentral in das Verzeichnis "errors" geloggt. Sollte ein Fehler
        auftreten, k&ouml;nnte das beim Beheben hilfreich sein.</p>
    </li>
    <li><p style="color: dimgray">Folgendes habe ich bis zur Version 0.4.0 geplant:</p>
        <ul>
            <li><p style="color: dimgray">Version 0.3.6 kommt als n&auml;chstes. Mit ihr wird die Aktion nach dem Upload
                des
                Videos stabilisiert, was aktuell mehr oder weniger gut funktioniert.</p>
            </li>
            <li><p style="color: dimgray">In Version 0.3.7 wird die C#-Schnittstelle komplett &uuml;berarbeitet
                werden.</p>
            </li>
            <li><p style="color: dimgray">Version 0.4.0 wird dann eine &Uuml;berraschung enthalten.</p></li>
        </ul>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.4 BETA (23.02.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Anzeige einer Liste im Hochladefenster</p>
    </li>
    <li><p><b>Feature</b>: Als Vorbereitung f&uuml;r die Version 0.4.0, f&uuml;r die etwas ganz tolles geplant ist,
        wurden
        zahlreiche Dinge am Uploader ge&auml;ndert. F&uuml;rs Auge sichtbar ist die &Auml;nderung des Hochladefensters:
        dort sieht man
        nun viel sch&ouml;ner, welche Videos gerade hochgeladen werden und welche in der Warteschlange stehen und als
        n&auml;chstes hochgeladen werden sollen. Das ganze wird nun auch mit sch&ouml;nen Farben &uuml;bersichtlich
        dargestellt.</p>
    </li>
    <li><p><b>Feature</b>: F&uuml;r die neue Oberfl&auml;che wurde ein gro&szlig;er Teil des Programms neu strukturiert.
        Als Folge hat
        sich die Stabilit&auml;t des Programmes verbessert. Allerdings stehen noch ein paar Tests im Zusammenwirken mit
        der
        Aktion nach dem Upload aus. Hier kann es noch zu Problemen kommen.</p>
    </li>
    <li><p><b>Feature</b>: Dadurch wird die Verwaltung von hochzuladenen Videos auch erweitert. Folgene Aktionen k&ouml;nnen
        nun durchgef&uuml;hrt werden:</p>
        <ul>
            <li><p>Der Upload eines wartenden Videos kann sofort gestartet werden, auch, wenn gerade noch andere Videos
                hochladen. Es ist also in Zukunft m&ouml;glich, mehrere Videos gleichzeitig hochzuladen.</p></li>
            <li><p>Der Upload von Videos kann nach Belieben pausiert und fortgesetzt werden</p></li>
            <li><p>Der Upload von Videos kann tempor&auml;r &uuml;bersprungen werden</p></li>
            <li><p>Der Upload von Videos kann abgebrochen werden</p></li>
        </ul>
    </li>
    <li><p><b>Feature</b>: Fehler beim Hochladen werden nun deutlich besser dargestellt</p>
    </li>
    <li><p style="color: dimgray">In Zukunft werden die Ver&ouml;ffentlichungshinweise auch Informationen zu den zuk&uuml;nftigen
        Versionen enthalten, allerdings in grauer Schrift, damit man wei&szlig; was noch in Planung ist.</p>
        <p style="color: dimgray">Folgendes habe ich bis zur Version 0.4.0 geplant:</p>
        <ul>
            <li><p style="color: dimgray">Es soll m&ouml;glich sein, Videos noch w&auml;hrend des Uploads zu bearbeiten,
                sodass
                &Auml;nderungen an Beschreibung, usw. w&auml;hrend des Uplodas m&ouml;glich sind. Vielleicht sogar noch,
                wenn das Video
                schon fertig hochgeladen ist. Das wird wahrscheinlich Version 0.3.5.</p>
            </li>
            <li><p style="color: dimgray">Es wird eine &Uuml;berarbeitung der Aktion nach dem Upload aller Videos geben.
                Hier
                gab es immer wieder noch kleinere Bugs und die Struktur gef&auml;llt mir auch nicht mehr so ganz. Je
                nach
                Umfang der &Uuml;berarbeitung werden die &Auml;nderungen teil der Version 0.3.5 oder aber die Version
                0.3.6.</p>
            </li>
            <li><p style="color: dimgray">Es wird eine &Uuml;berarbeitung der C#-Programmierschnittstelle geben. In der
                Folge
                wird man deutlich bessere M&ouml;glichkeiten haben, Aktionen vor, w&auml;hrend und nach des Uploads zu
                setzen.
                Au&szlig;erdem werden die Funktionen, die ganz fr&uuml;her aus dem Skripting-Tab bekannt sind, zur&uuml;ckkehren.
                Das
                wird die n&auml;chste eigene Version (entweder 0.3.6 oder 0.3.7).</p></li>
            <li><p style="color: dimgray">Nebenbei plane ich f&uuml;r die Zeit nach dem vorigen Punkt eine
                Video-Tutorial-Reihe, die Erkl&auml;rungen und Tipps zur Benutzung des Programmes enth&auml;lt. Diese
                wird dann in
                einer der neuen Versionen in den Ver&ouml;ffentlichungshinweisen verlinkt und au&szlig;erdem auch als
                eigener Punkt
                im Hauptfenster im Men&uuml; "Support" angegeben werden.</p></li>
            <li><p style="color: dimgray">Version 0.4.0 erh&auml;lt dann eine &Uuml;berraschung. Was es ist, wird noch
                nicht
                verraten. ;)</p></li>
        </ul>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.3 BETA (23.01.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Taskleistensymbol zeigt Fortschritt an</p>
    </li>
    <li><p><b>Feature</b>: Der Uploader zeigt nun den Fortschritt des aktuellen Uploads auch beim Symbol in der
        Taskleiste an. Auf diese Art und Weise ist es m&ouml;glich, ihn zu sehen, ohne das Fenster aktivieren zu m&uuml;ssen.
    </p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.2 BETA (20.01.2019)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Laufzeit des Uploads wird angezeigt</p>
    </li>
    <li><p><b>Feature</b>: W&auml;hrend eines Uploads wird nun angezeigt, wie lange der Upload bereits lief und wie
        lange er
        gesch&auml;tzt noch laufen wird.</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.3.1 BETA (09.12.2018)</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Das Ver&ouml;ffentlichungsdatum wird gespeichert</p>
    </li>
    <li><p><b>Feature</b>: Wenn man die Ver&ouml;ffentlichungszeiten durch den Uploader planen l&auml;sst, merkt dieser
        sich nun
        pro Pfad das geplante Datum des letzten hochgeladenen Videos und schl&auml;gt das darauffolgende Datum beim n&auml;chsten
        Start vor.</p>
    </li>
    <li><p><b>Bugfix</b>: Ca. 2 Stunden nach Start der Ordner&uuml;berwachung scheiterten alle weiteren Uploads bis zum
        Neustart des Programms. Das ist nun behoben.</p>
    </li>
    <li><p><b>Bugfix</b>: Fehler in Texten wurden behoben.</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>
<p>In Zukunft wird es wieder h&auml;ufiger eine neue Version geben. Ich habe vor kurzem mein Studium beendet und musste
    mich
    erst daran gew&ouml;hnen, Vollzeit zu arbeiten. Das sollte nun gepackt sein, also kann ich wieder mehr am Uploader
    arbeiten.<br/>
    Liebe Gr&uuml;&szlig;e!</p>


<h2>Version 0.3.0 BETA</h2>
<ul>
    <li>
        <p><b>Main feature</b>: &Uuml;berarbeitung der Skript-Funktionalit&auml;t</p>
    </li>
    <li>
        <p><b>Feature</b>: Videos k&ouml;nnen nun einfach geplant werden. Daf&uuml;r kann man in den Feldern Titel,
            Beschreibung,
            Tags und Thumbnail-Pfad mittels <code>&lt;BELIEBIGER PLATZHALTERNAME&gt;</code> Platzhalter definieren. Der
            Platzhaltername kann frei gew&auml;hlt werden, z. B.<code> &lt;Folgenname&gt;</code> oder
            <code>&lt;tags&gt;</code>
        </p>
        <p>Hier ist ein Bild dazu:</p>
        <p><img src="https://abload.de/img/v0.3.0-tut-1e6dlj.png"
                alt="Beispielbild f&uuml;r Definierung von Platzhaltern"
                width="90%" height="auto" style="width: 90%; max-width: 90%; height: auto"/>
        </p>
    </li>
    <li>
        <p><b>Feature</b>: Anschlie&szlig;end kann man im neuen Tab "Videos planen" die Dateinamen von in der Zukunft
            hochzuladenden Videos angeben und die Platzhalter f&uuml;r diese f&uuml;llen.</p>
        <p>Hier ist ein Bild dazu:</p>
        <p><img src="https://abload.de/img/v0.3.0-tut-2bci55.png"
                alt="Beispielbild f&uuml;r die Einstellung von Platzhaltern" width="90%" height="auto"
                style="width: 90%; max-width: 90%; height: auto"/></p>
    </li>
    <li><p><b>Feature</b>: Beim Upload werden die Platzhalter automatisch durch den geplanten Wert ersetzt.</p>
    </li>
    <li><p><b>Feature</b>: LUA wurde entfernt. In Zukunft k&ouml;nnen mit <code>&lt;NAME&gt;</code> Platzhalter
        definiert
        werden und mittels <code>&lt;&lt;&lt; CODE &gt;&gt;&gt;</code> C#-Skripte ausgef&uuml;hrt werden. Das sollte
        deutlich einfacher sein, als vorher.</p>
    </li>
    <li><p><b>Feature</b>: Im Template-Fenster wird gefragt, ob gespeichert werden soll, wenn ungespeicherte &Auml;nderungen
        existieren und diese durch die n&auml;chste Aktion (z. B. Fenster schlie&szlig;en) verlorengehen w&uuml;rden.
    </p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.2.2 BETA</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Bugfix</p>
    </li>
    <li><p><b>Bugfix</b>: Das Programm st&uuml;rzt nun nicht mehr ab, wenn unter Windows 7 die stfu-update.exe
        vollkommen
        ohne Grund blockiert wird (ja, daf&uuml;r gibt es eine eigene Version und PS: ich hasse dich, Windows
        Explorer!).</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.2.1 BETA</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Erstellung des Release-Notes-Fensters</p>
    </li>
    <li><p><b>Feature</b>: Neuerungen werden nun in einem separaten Fenster angezeigt (das ist das Fenster, in dem du
        diese Infos gerade liest. ^^ )</p>
    </li>
    <li><p><b>Feature</b>: Neuerungen k&ouml;nnen ausgeblendet werden und werden dann nur noch beim ersten Programmstart
        nach
        einem Update angezeigt</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.2.0 BETA</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Hinzuf&uuml;gen des Update-Mechanismus</p>
    </li>
    <li><p><b>Feature</b>: Das Programm beinhaltet nun einen Auto-Updater, der beim Start auf neue Versionen pr&uuml;ft
        und
        diese automatisch installieren kann</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.1.2 BETA</h2>
<ul>
    <li>
        <p><b>Main feature</b>: C#-Skripte k&ouml;nnen verwendet werden</p>
    </li>
    <li><p><b>Feature</b>: Es ist nun m&ouml;glich, C#-Skripting in den Feldern Titel, Beschreibung, Tags und
        Thumbnail-Pfad
        zu nutzen. Skripte werden mittels <code>&lt;&lt;&lt;</code> eingeleitet und mittels <code>&gt;&gt;&gt;</code>
        beendet. </p>
    </li>
    <li><p><b>Feature</b>: Zus&auml;tzlich gibt es noch einen Tab, in dem Vorbereitungen und Nachbereitungen getroffen
        werden
        k&ouml;nnen, die f&uuml;r alle C#-Skripte gelten (z. B. Anlegen einer Variable)</p>
    </li>
    <li><p><b>Feature</b>: Fehler werden in einen Ordner "errors" geloggt.</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.1.1 BETA</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Kleinere &Auml;nderungen</p>
    </li>
    <li><p><b>Feature</b>: Ein Tutorial steht in der ersten Version zur Verf&uuml;gung (<a
            href="https://www.youtube.com/watch?v=XjYvy36BrNo">https://www.youtube.com/watch?v=XjYvy36BrNo</a>)</p>
    </li>
    <li><p><b>Feature</b>: Im Pfad-Fenster kann man nun Videos zum zugeh&ouml;rigen Pfad direkt als hochgeladen
        markieren</p>
    </li>
    <li><p><b>Zahlreiche Bugfixes</b></p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>


<h2>Version 0.1.0 BETA</h2>
<ul>
    <li>
        <p><b>Main feature</b>: Erste Version. :-)</p>
    </li>
    <li><p><b>Feature</b>: Man kann Templates anlegen</p>
    </li>
    <li><p><b>Feature</b>: Es ist m&ouml;glich, Pfade zu registrieren und diese automatisiert zu &uuml;berwachen</p>
    </li>
    <li><p><b>Feature</b>: Ein Account kann hinzugef&uuml;gt werden</p>
    </li>
    <li><p><b>Feature</b>: Videos k&ouml;nnen hochgeladen und automatisiert geplant werden.</p>
    </li>
</ul>
<p><span style="color: red">Bei Fehlern</span> k&ouml;nnt ihr euch gerne melden, Kontaktm&ouml;glichkeiten sind im
    Programm im
    Men&uuml; "Hilfe / Support"
    verlinkt. </p>